iPig/src/Reports/АнализСтада/АнализСтада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АнализСтада</name>
</mdclass:Report>

iPig/src/InformationRegisters/ЖурналОпороса/ЖурналОпороса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОпороса</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Живорожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мертвые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Слаборожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Муммии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Свинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереведеноПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDГнезда</name>
    <type>
      <types>CatalogRef.IDГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОтъема/ЖурналОтъема.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтъема</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОтъемышей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозрастПриПодсадке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодМеста</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОсеменения/ЖурналОсеменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОсеменения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОпоросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаАбортаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтъема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпороса</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк1</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк2</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпороса</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПричины</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк1</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк2</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОценкаСлучки</name>
    <type>
      <types>EnumRef.ОценкаСлучки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/Аборт/Аборт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аборт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/КарточкаВнесенияДанных/КарточкаВнесенияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаВнесенияДанных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВвод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВыбытие</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЖивотного</name>
    <type>
      <types>EnumRef.ТипЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDНомер</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УшнойВыщип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиОтец</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиМать</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/КлючевыеЦифрыОпороса/КлючевыеЦифрыОпороса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлючевыеЦифрыОпороса</name>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДниСупоросности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтъема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодсосныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПотеряноКормодней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаАборта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСлучки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВозрастОтъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Enums/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоследнееСобытие</name>
  <enumValues>
    <name>Случка</name>
  </enumValues>
  <enumValues>
    <name>УЗИ</name>
  </enumValues>
  <enumValues>
    <name>Опорос</name>
  </enumValues>
  <enumValues>
    <name>Отъем</name>
  </enumValues>
  <enumValues>
    <name>Ввод</name>
  </enumValues>
  <enumValues>
    <name>Выбытие</name>
  </enumValues>
  <enumValues>
    <name>Аборт</name>
  </enumValues>
</mdclass:Enum>

iPig/src/Reports/АнализСтада/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры                   

&НаСервере
Процедура СформироватьОтчетНаСервере() 
	ТабДок.Очистить();
	ТабДок.РазмерСтраницы  = "A4";      
	МассивОпоросов 	= Новый Массив;
	МассивСлучек	= Новый Массив; 
	МассивЖиворожденных		= Новый Массив; 
	МассивСлаборожденных 	= Новый Массив;   
	СуммаЖиворожденных 	= 0;
	СуммаОпросов		= 0;
	СуммаСлучек 		= 0;
	Макет = Отчеты.АнализСтада.ПолучитьМакет("АнализСтада"); 
	ОбластьШапкаОтчета = Макет.ПолучитьОбласть("ШапкаОтчета");
	ОбластьШапкаГруппа = Макет.ПолучитьОбласть("Группа|Шапка");
	ОбластьШапкаОпорос = Макет.ПолучитьОбласть("Опорос|Шапка");
	ОбластьШапкаОтъем  = Макет.ПолучитьОбласть("Отъем|Шапка");  
	ОбластьШапкаВоспроизводство  = Макет.ПолучитьОбласть("Воспроизводство|Шапка");
	ОбластьШапкаРезультат		 = Макет.ПолучитьОбласть("Результат|Шапка");
	ОбластьШапкаПроизводство	 = Макет.ПолучитьОбласть("Производство|Шапка");
	
	
	
	ОбластьШапкаГруппаДанные = Макет.ПолучитьОбласть("Группа|Данные");
	ОбластьГруппаИтого = Макет.ПолучитьОбласть("Группа|Итого");
	
	ОбластьШапкаОтчета.Параметры.Организация  = Константы.Организация.Получить();
	ОбластьШапкаОтчета.Параметры.ПериодОтчета = Период;
	ТабДок.Вывести(ОбластьШапкаОтчета);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЖурналОпороса.НомерОпороса КАК НомерОпороса
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
	|ГДЕ
	|	ЖурналОпороса.Период МЕЖДУ &ДатаНач И &ДатаКон
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЖурналОтъема.НомерОпороса)
	|ИЗ
	|	РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
	|ГДЕ
	|	ЖурналОтъема.Период МЕЖДУ &ДатаНач И &ДатаКон
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналОсеменения.НомерОпороса
	|ИЗ
	|	РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
	|ГДЕ
	|	ЖурналОсеменения.Период МЕЖДУ &ДатаНач И &ДатаКон 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТДанные.НомерОпороса) КАК НомерОпороса
	|ИЗ
	|	ВТДанные КАК ВТДанные";
	Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	МаксНомерОпороса = 0;
	Пока РезультатЗапроса.Следующий() Цикл
		МаксНомерОпороса = РезультатЗапроса.НомерОпороса;	
	КонецЦикла;
	НомерОпороса = 1;
	ТабДок.Вывести(ОбластьШапкаГруппа);
	Пока НомерОпороса <= МаксНомерОпороса Цикл		
		ОбластьШапкаГруппаДанные.Параметры.НомерОпороса = НомерОпороса;
		ТабДок.Присоединить(ОбластьШапкаГруппаДанные);  
		НомерОпороса = НомерОпороса + 1;
	КонецЦикла;  
	ТабДок.Присоединить(ОбластьГруппаИтого);
	
	#Область Воспроизводство
	НомерОпороса = 1;
	ТабДок.Вывести(ОбластьШапкаВоспроизводство);    
	ТЗДанные = Новый ТаблицаЗначений;
	ТЗДанные.Колонки.Добавить("КоличествоОсеменений");
	ТЗДанные.Колонки.Добавить("ДнейОтОтъема");
	ТЗДанные.Колонки.Добавить("СвиноматкиОтОтъема");  
	ТЗДанные.Колонки.Добавить("ПовторныхОсеменений"); 
	ТЗДанные.Колонки.Добавить("Абортов");  
	ТЗДанные.Колонки.Добавить("ВозрастРем");
	ТЗДанные.Колонки.Добавить("ОсемененоПосле7Дней");
	Пока НомерОпороса <= МаксНомерОпороса Цикл	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЖурналОсеменения.НомерЖивотного КАК НомерЖивотного,
		|	ЖурналОсеменения.НомерОпороса КАК НомерОпороса,
		|	ЖурналОсеменения.ДатаВвода КАК ДатаВвода,
		|	ЖурналОсеменения.Период КАК Период
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		|ГДЕ
		|	ЖурналОсеменения.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЖурналОсеменения.НомерОпороса = &НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанные.НомерОпороса КАК НомерОпороса,
		|	КОЛИЧЕСТВО(ВТДанные.НомерЖивотного) КАК КоличествоОсеменений
		|ПОМЕСТИТЬ ВТРезультатКоличество
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТДанные.НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЖурналОтъема.Период КАК Период,
		|	ЖурналОтъема.НомерОпороса КАК НомерОпороса,
		|	ЖурналОтъема.НомерЖивотного КАК НомерЖивотного,
		|	ЖурналОтъема.ДатаВвода КАК ДатаВвода
		|ПОМЕСТИТЬ ВТОтъем
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
		|		ПО ВТДанные.НомерЖивотного = ЖурналОтъема.НомерЖивотного
		|			И ВТДанные.ДатаВвода = ЖурналОтъема.ДатаВвода
		|ГДЕ
		|	ЖурналОтъема.Мачеха = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ЖурналОсеменения.Период) КАК Период,
		|	ЖурналОсеменения.НомерОпороса КАК НомерОпороса,
		|	ЖурналОсеменения.НомерЖивотного КАК НомерЖивотного,
		|	ЖурналОсеменения.ДатаВвода КАК ДатаВвода
		|ПОМЕСТИТЬ ВТОсемение
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		|		ПО ВТДанные.НомерЖивотного = ЖурналОсеменения.НомерЖивотного
		|			И ВТДанные.ДатаВвода = ЖурналОсеменения.ДатаВвода
		|ГДЕ
		|	ЖурналОсеменения.НомерОпороса = &НомерОпороса
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналОсеменения.НомерЖивотного,
		|	ЖурналОсеменения.НомерОпороса,
		|	ЖурналОсеменения.ДатаВвода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Счетчик,
		|	ВТОсемение.Период КАК Период,
		|	ВТОсемение.НомерОпороса КАК НомерОпороса,
		|	ВТОсемение.ДатаВвода КАК ДатаВвода,
		|	ВТОсемение.НомерЖивотного КАК НомерЖивотного
		|ПОМЕСТИТЬ ВТОсеменениеФильтр
		|ИЗ
		|	ВТОсемение КАК ВТОсемение
		|ГДЕ
		|	ВТОсемение.Период МЕЖДУ &ДатаНач И &ДатаКон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТОсеменениеФильтр.НомерЖивотного) КАК НомерЖивотного
		|ПОМЕСТИТЬ ВТСвиноматок
		|ИЗ
		|	ВТОсеменениеФильтр КАК ВТОсеменениеФильтр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОКР(СУММА(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТОтъем.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТОсемение.Период, ДЕНЬ), ДЕНЬ)) / ВТСвиноматок.НомерЖивотного, 2) КАК ДнейДо1Осеменения,
		|	СУММА(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТОтъем.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТОсемение.Период, ДЕНЬ), ДЕНЬ)) КАК ДнейОтОтъема,
		|	ВТСвиноматок.НомерЖивотного КАК СвиноматкиОтОтъема,
		|	ВТОтъем.НомерОпороса + 1 КАК НомерОпороса
		|ПОМЕСТИТЬ ВТДнейДоОсеменения
		|ИЗ
		|	ВТОтъем КАК ВТОтъем
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсеменениеФильтр КАК ВТОсемение
		|		ПО (ВТОсемение.НомерОпороса = ВТОтъем.НомерОпороса + 1)
		|			И (ВТОсемение.НомерЖивотного = ВТОтъем.НомерЖивотного)
		|			И (ВТОсемение.ДатаВвода = ВТОтъем.ДатаВвода),
		|	ВТСвиноматок КАК ВТСвиноматок
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСвиноматок.НомерЖивотного,
		|	ВТОтъем.НомерОпороса
		|
		|ИМЕЮЩИЕ
		|	ОКР(СУММА(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТОтъем.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТОсемение.Период, ДЕНЬ), ДЕНЬ)) / ВТСвиноматок.НомерЖивотного, 2) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРезультатКоличество.КоличествоОсеменений КАК КоличествоОсеменений,
		|	ВТДнейДоОсеменения.ДнейДо1Осеменения КАК ДнейДо1Осеменения,
		|	ВТДнейДоОсеменения.ДнейОтОтъема КАК ДнейОтОтъема,
		|	ВТДнейДоОсеменения.СвиноматкиОтОтъема КАК СвиноматкиОтОтъема
		|ИЗ
		|	ВТРезультатКоличество КАК ВТРезультатКоличество
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДнейДоОсеменения КАК ВТДнейДоОсеменения
		|		ПО (ВТДнейДоОсеменения.НомерОпороса = ВТРезультатКоличество.НомерОпороса)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ЖурналОсеменения.Период) КАК ПовторныхОсеменений,
		|	КОЛИЧЕСТВО(ВТДанные.НомерЖивотного) КАК НомерЖивотного
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		|		ПО ВТДанные.НомерЖивотного = ЖурналОсеменения.НомерЖивотного
		|			И ВТДанные.НомерОпороса = ЖурналОсеменения.НомерОпороса
		|			И ВТДанные.ДатаВвода = ЖурналОсеменения.ДатаВвода
		|ГДЕ
		|	ВТДанные.Период > ЖурналОсеменения.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналОсеменения.НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Аборт.Период) КАК Абортов,
		|	КОЛИЧЕСТВО(Аборт.НомерЖивотного) КАК НомерЖивотного
		|ИЗ
		|	РегистрСведений.Аборт КАК Аборт
		|ГДЕ
		|	Аборт.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И Аборт.НомерОпороса = &НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЖурналОсеменения.НомерОпороса = 1
		|			ТОГДА ОКР(СУММА(ВЫБОР
		|							КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(КарточкаВнесенияДанных.ДатаРождения, ДЕНЬ), НАЧАЛОПЕРИОДА(ЖурналОсеменения.Период, ДЕНЬ), ДЕНЬ) < 365
		|								ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(КарточкаВнесенияДанных.ДатаРождения, ДЕНЬ), НАЧАЛОПЕРИОДА(ЖурналОсеменения.Период, ДЕНЬ), ДЕНЬ)
		|							ИНАЧЕ 365
		|						КОНЕЦ) / КОЛИЧЕСТВО(ЖурналОсеменения.НомерЖивотного), 2)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВозрастРем
		|ИЗ
		|	РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КарточкаВнесенияДанных КАК КарточкаВнесенияДанных
		|		ПО ЖурналОсеменения.НомерЖивотного = КарточкаВнесенияДанных.НомерЖивотного
		|			И ЖурналОсеменения.ДатаВвода = КарточкаВнесенияДанных.Период
		|ГДЕ
		|	ЖурналОсеменения.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЖурналОсеменения.НомерОпороса = &НомерОпороса
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналОсеменения.НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТОсеменениеФильтр.Счетчик) КАК Счетчик
		|ПОМЕСТИТЬ ВТОсеменДо1Случки
		|ИЗ
		|	ВТОсеменениеФильтр КАК ВТОсеменениеФильтр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОсеменДо1Случки.Счетчик - КОЛИЧЕСТВО(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТОтъем.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТОсемение.Период, ДЕНЬ), ДЕНЬ)) КАК ОсемененоПосле7Дней
		|ИЗ
		|	ВТОтъем КАК ВТОтъем
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсеменениеФильтр КАК ВТОсемение
		|		ПО (ВТОсемение.НомерОпороса = ВТОтъем.НомерОпороса + 1)
		|			И (ВТОсемение.НомерЖивотного = ВТОтъем.НомерЖивотного)
		|			И (ВТОсемение.ДатаВвода = ВТОтъем.ДатаВвода),
		|	ВТОсеменДо1Случки КАК ВТОсеменДо1Случки
		|ГДЕ
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТОтъем.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТОсемение.Период, ДЕНЬ), ДЕНЬ) <= 7
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОсеменДо1Случки.Счетчик"; 
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("НомерОпороса",НомерОпороса);
		РезультатЗапросаПакет = Запрос.ВыполнитьПакет();  
		ОбластьШапкаВоспроизводствоДанные  = Макет.ПолучитьОбласть("Воспроизводство|Данные");   
		НоваяСтрока = ТЗДанные.Добавить();
		РезультатЗапроса = РезультатЗапросаПакет[7].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл  
			ОбластьШапкаВоспроизводствоДанные.Параметры.Заполнить(РезультатЗапроса); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);	
		КонецЦикла; 	
		РезультатЗапроса = РезультатЗапросаПакет[8].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл  
			ОбластьШапкаВоспроизводствоДанные.Параметры.Заполнить(РезультатЗапроса);
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);	
		КонецЦикла; 
		РезультатЗапроса = РезультатЗапросаПакет[9].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл  
			ОбластьШапкаВоспроизводствоДанные.Параметры.Заполнить(РезультатЗапроса); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);	
		КонецЦикла;  
		РезультатЗапроса = РезультатЗапросаПакет[10].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл  
			ОбластьШапкаВоспроизводствоДанные.Параметры.Заполнить(РезультатЗапроса); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);	
		КонецЦикла;    
		РезультатЗапроса = РезультатЗапросаПакет[12].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл  
			ОбластьШапкаВоспроизводствоДанные.Параметры.Заполнить(РезультатЗапроса);  
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);	
		КонецЦикла;            
		МассивСлучек.Добавить(?(ЗначениеЗаполнено(ОбластьШапкаВоспроизводствоДанные.Параметры.КоличествоОсеменений),ОбластьШапкаВоспроизводствоДанные.Параметры.КоличествоОсеменений,0));
		ТабДок.Присоединить(ОбластьШапкаВоспроизводствоДанные);   
		
		НомерОпороса = НомерОпороса + 1;
	КонецЦикла;	
	
	
	ОбластьВоспроизводствоИтого  = Макет.ПолучитьОбласть("Воспроизводство|Итого");
	ОбластьВоспроизводствоИтого.Параметры.КоличествоОсеменений = ТЗДанные.Итог("КоличествоОсеменений");  
	Если ТЗДанные.Итог("СвиноматкиОтОтъема") > 0 Тогда
		ОбластьВоспроизводствоИтого.Параметры.ДнейДо1Осеменения = Окр(ТЗДанные.Итог("ДнейОтОтъема")/ТЗДанные.Итог("СвиноматкиОтОтъема"),2);    
	КонецЕсли;
	ОбластьВоспроизводствоИтого.Параметры.ПовторныхОсеменений = ТЗДанные.Итог("ПовторныхОсеменений");
	ОбластьВоспроизводствоИтого.Параметры.Абортов = ТЗДанные.Итог("Абортов");   
	ОбластьВоспроизводствоИтого.Параметры.ВозрастРем = ТЗДанные.Итог("ВозрастРем");
	ОбластьВоспроизводствоИтого.Параметры.ОсемененоПосле7Дней = ТЗДанные.Итог("ОсемененоПосле7Дней");
	
	
	ТабДок.Присоединить(ОбластьВоспроизводствоИтого);
	#КонецОбласти
	
	#Область Опорос
	НомерОпороса = 1;
	ТабДок.Вывести(ОбластьШапкаОпорос);
	Пока НомерОпороса <= МаксНомерОпороса Цикл	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЖурналОпороса.НомерЖивотного КАК НомерЖивотного,
		|	ЖурналОпороса.Живорожденные КАК Живорожденные,
		|	ЖурналОпороса.Слаборожденные КАК Слаборожденные,
		|	ЖурналОпороса.Муммии + ЖурналОпороса.Мертвые КАК Мертворожденные,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
		|	ЖурналОпороса.Муммии КАК Муммии
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
		|ГДЕ
		|	ЖурналОпороса.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЖурналОпороса.НомерОпороса = &НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТДанные.Живорожденные) КАК Живорожденные,
		|	СУММА(ВТДанные.Слаборожденные) КАК Слаборожденные,
		|	СУММА(ВТДанные.Мертворожденные) КАК Мертворожденные,
		|	МАКСИМУМ(ВТДанные.НомерЗаписи) КАК НомерЗаписи,
		|	СУММА(ВТДанные.Муммии) КАК Муммии
		|ПОМЕСТИТЬ ВТРасчет
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРасчет.НомерЗаписи КАК КоличествоОпоросов,
		|	ВТРасчет.Живорожденные КАК ЖиворожденныеВсего,
		|	ОКР(ВТРасчет.Живорожденные / ВТРасчет.НомерЗаписи, 2) КАК ЖиворожденныеНаОпорос,
		|	ВТРасчет.Мертворожденные КАК МертворожденныеВсего,
		|	ОКР(ВТРасчет.Мертворожденные / ВТРасчет.НомерЗаписи, 2) КАК МертворожденныеНаОпорос,
		|	ВТРасчет.Слаборожденные КАК СлаборожденныеВсего,
		|	ОКР(ВТРасчет.Слаборожденные / ВТРасчет.НомерЗаписи, 2) КАК СлаборожденныеНаОпорос,
		|	ВТРасчет.Живорожденные + ВТРасчет.Мертворожденные КАК ВсегоРожденныхЗаПериод,
		|	ОКР((ВТРасчет.Живорожденные + ВТРасчет.Мертворожденные) / ВТРасчет.НомерЗаписи, 2) КАК ВсегоРожденныхНаОпорос,
		|	ОКР(ВТРасчет.Муммии / ВТРасчет.НомерЗаписи, 2) КАК МуммииНаОпорос
		|ИЗ
		|	ВТРасчет КАК ВТРасчет"; 
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("НомерОпороса",НомерОпороса);
		РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
		ОбластьШапкаОпоросДанные = Макет.ПолучитьОбласть("Опорос|Данные");
		Пока РезультатЗапроса.Следующий() Цикл  
			ОбластьШапкаОпоросДанные.Параметры.Заполнить(РезультатЗапроса);	 
		КонецЦикла; 
		МассивОпоросов.Добавить(?(ЗначениеЗаполнено(ОбластьШапкаОпоросДанные.Параметры.КоличествоОпоросов),ОбластьШапкаОпоросДанные.Параметры.КоличествоОпоросов,0));
		МассивЖиворожденных.Добавить(?(ЗначениеЗаполнено(ОбластьШапкаОпоросДанные.Параметры.ЖиворожденныеВсего),ОбластьШапкаОпоросДанные.Параметры.ЖиворожденныеВсего,0));
		МассивСлаборожденных.Добавить(?(ЗначениеЗаполнено(ОбластьШапкаОпоросДанные.Параметры.СлаборожденныеВсего),ОбластьШапкаОпоросДанные.Параметры.СлаборожденныеВсего,0));
		ТабДок.Присоединить(ОбластьШапкаОпоросДанные); 
		НомерОпороса = НомерОпороса + 1;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЖурналОпороса.НомерЖивотного КАК НомерЖивотного,
	|	ЖурналОпороса.Живорожденные КАК Живорожденные,
	|	ЖурналОпороса.Слаборожденные КАК Слаборожденные,
	|	ЖурналОпороса.Муммии + ЖурналОпороса.Мертвые КАК Мертворожденные,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	|	ЖурналОпороса.Муммии КАК Муммии
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
	|ГДЕ
	|	ЖурналОпороса.Период МЕЖДУ &ДатаНач И &ДатаКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТДанные.Живорожденные) КАК Живорожденные,
	|	СУММА(ВТДанные.Слаборожденные) КАК Слаборожденные,
	|	СУММА(ВТДанные.Мертворожденные) КАК Мертворожденные,
	|	МАКСИМУМ(ВТДанные.НомерЗаписи) КАК НомерЗаписи,
	|	СУММА(ВТДанные.Муммии) КАК Муммии
	|ПОМЕСТИТЬ ВТРасчет
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасчет.НомерЗаписи КАК КоличествоОпоросов,
	|	ВТРасчет.Живорожденные КАК ЖиворожденныеВсего,
	|	ОКР(ВТРасчет.Живорожденные / ВТРасчет.НомерЗаписи, 2) КАК ЖиворожденныеНаОпорос,
	|	ВТРасчет.Мертворожденные КАК МертворожденныеВсего,
	|	ОКР(ВТРасчет.Мертворожденные / ВТРасчет.НомерЗаписи, 2) КАК МертворожденныеНаОпорос,
	|	ВТРасчет.Слаборожденные КАК СлаборожденныеВсего,
	|	ОКР(ВТРасчет.Слаборожденные / ВТРасчет.НомерЗаписи, 2) КАК СлаборожденныеНаОпорос,
	|	ВТРасчет.Живорожденные + ВТРасчет.Мертворожденные КАК ВсегоРожденныхЗаПериод,
	|	ОКР((ВТРасчет.Живорожденные + ВТРасчет.Мертворожденные) / ВТРасчет.НомерЗаписи, 2) КАК ВсегоРожденныхНаОпорос,
	|	ОКР(ВТРасчет.Муммии / ВТРасчет.НомерЗаписи, 2) КАК МуммииНаОпорос
	|ИЗ
	|	ВТРасчет КАК ВТРасчет"; 
	Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
	ОбластьОпоросИтого = Макет.ПолучитьОбласть("Опорос|Итого"); 
	Пока РезультатЗапроса.Следующий() Цикл  
		ОбластьОпоросИтого.Параметры.Заполнить(РезультатЗапроса);	 
	КонецЦикла;	
	ТабДок.Присоединить(ОбластьОпоросИтого);
	#КонецОбласти 
	
	#Область Производство 
	НомерОпороса = 1;
	ТабДок.Вывести(ОбластьШапкаПроизводство);
	Пока НомерОпороса <= МаксНомерОпороса Цикл	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЖурналОпороса.НомерЖивотного КАК НомерЖивотного,
		|	ЖурналОпороса.Живорожденные КАК Живорожденные,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
		|ГДЕ
		|	ЖурналОпороса.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЖурналОпороса.НомерОпороса = &НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТДанные.Живорожденные) КАК Живорожденные,
		|	МАКСИМУМ(ВТДанные.НомерЗаписи) КАК НомерЗаписи
		|ПОМЕСТИТЬ ВТРасчет
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРасчет.НомерЗаписи КАК КоличествоОпоросов,
		|	ЕСТЬNULL(ОКР(ВТРасчет.Живорожденные / ВТРасчет.НомерЗаписи, 2), 0) КАК ЖиворожденныеНаОпорос
		|ИЗ
		|	ВТРасчет КАК ВТРасчет"; 
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("НомерОпороса",НомерОпороса);
		РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
		ОбластьШапкаПроизводствоДанные = Макет.ПолучитьОбласть("Производство|Данные");
		ЖиворожденныеНаОпорос = 0;
		Пока РезультатЗапроса.Следующий() Цикл  
			ЖиворожденныеНаОпорос = РезультатЗапроса.ЖиворожденныеНаОпорос;	 
		КонецЦикла;    
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЖурналОтъема.КоличествоОтъемышей КАК КоличествоОтъемышей,
		|	ЖурналОтъема.МассаВсего КАК МассаВсего,
		|	ЖурналОтъема.НомерЖивотного КАК НомерЖивотного,
		|	АВТОНОМЕРЗАПИСИ() КАК КоличествоОтъемов
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
		|ГДЕ
		|	ЖурналОтъема.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЖурналОтъема.НомерОпороса = &НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТДанные.КоличествоОтъемышей) КАК КоличествоОтъемышей,
		|	СУММА(ВТДанные.МассаВсего) КАК МассаВсего,
		|	МАКСИМУМ(ВТДанные.КоличествоОтъемов) КАК КоличествоОтъемов
		|ПОМЕСТИТЬ ВТРасчет
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРасчет.КоличествоОтъемышей КАК ОтнятыхПоросят,
		|	ВТРасчет.МассаВсего КАК ВесОтъема,
		|	ВЫБОР
		|		КОГДА ВТРасчет.КоличествоОтъемышей = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОКР(ВТРасчет.МассаВсего / ВТРасчет.КоличествоОтъемышей, 1)
		|	КОНЕЦ КАК ВесОтъемаПоросят,
		|	ВЫБОР
		|		КОГДА ВТРасчет.КоличествоОтъемов = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ОКР(ВТРасчет.КоличествоОтъемышей / ВТРасчет.КоличествоОтъемов, 1), 0)
		|	КОНЕЦ КАК ОтнятоНаОтъем
		|ИЗ
		|	ВТРасчет КАК ВТРасчет";
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("НомерОпороса",НомерОпороса);
		РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
		Пока РезультатЗапроса.Следующий() Цикл 		
			ОтнятыхНаОпорос = РезультатЗапроса.ОтнятоНаОтъем;;			
		КонецЦикла;                                     
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		|	КлючевыеЦифрыОпороса.ПодсосныеДни КАК ПодсосныеДни,
		|	КлючевыеЦифрыОпороса.ВозрастОтъема КАК ВозрастОтъема
		|ПОМЕСТИТЬ ВТПодсос
		|ИЗ
		|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		|ГДЕ
		|	КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		|	И КлючевыеЦифрыОпороса.НомерОпороса = &НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		|	КлючевыеЦифрыОпороса.ДниСупоросности КАК ДниСупоросности
		|ПОМЕСТИТЬ ВТСупоросность
		|ИЗ
		|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		|ГДЕ
		|	КлючевыеЦифрыОпороса.ДатаОпороса МЕЖДУ &ДатаНач И &ДатаКон
		|	И КлючевыеЦифрыОпороса.НомерОпороса = &НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		|	КлючевыеЦифрыОпороса.ПотеряноКормодней КАК ПотеряноКормодней
		|ПОМЕСТИТЬ ВТПотеряноДней
		|ИЗ
		|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		|ГДЕ
		|	(КлючевыеЦифрыОпороса.ДатаСлучки МЕЖДУ &ДатаНач И &ДатаКон
		|				И КлючевыеЦифрыОпороса.ДатаОпороса = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		|			ИЛИ КлючевыеЦифрыОпороса.ДатаАборта МЕЖДУ &ДатаНач И &ДатаКон)
		|	И КлючевыеЦифрыОпороса.НомерОпороса = &НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТСупоросность.ДниСупоросности), 0) КАК СупоросныхДней,
		|	КОЛИЧЕСТВО(ВТСупоросность.НомерЖивотного) КАК Опоросов
		|ИЗ
		|	ВТСупоросность КАК ВТСупоросность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТПодсос.ПодсосныеДни), 0) КАК ПодсосныеДни,
		|	КОЛИЧЕСТВО(ВТПодсос.НомерЖивотного) КАК Опоросов,
		|	ЕСТЬNULL(СУММА(ВТПодсос.ВозрастОтъема), 0) КАК ВозрастОтъема
		|ИЗ
		|	ВТПодсос КАК ВТПодсос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТПотеряноДней.ПотеряноКормодней), 0) КАК ПотеряноКормодней
		|ИЗ
		|	ВТПотеряноДней КАК ВТПотеряноДней";
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("НомерОпороса",НомерОпороса);
		РезультатЗапросаПакет = Запрос.ВыполнитьПакет(); 
		
		ПродуктивныеДни = 0;
		НепродуктивныеДни = 0;
		ПроизведеноОпоросов = 0;
		
		РезультатЗапроса = РезультатЗапросаПакет[3].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	
			ПродуктивныеДни = РезультатЗапроса.СупоросныхДней;  
			Если РезультатЗапроса.Опоросов > 0 Тогда  
				СупоросныхДнейНаОпорос = Окр(РезультатЗапроса.СупоросныхДней / РезультатЗапроса.Опоросов,0) ;			
			Иначе
				СупоросныхДнейНаОпорос = 0;
			КонецЕсли;
		КонецЦикла;  
		РезультатЗапроса = РезультатЗапросаПакет[4].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	
			ПродуктивныеДни = ПродуктивныеДни + РезультатЗапроса.ПодсосныеДни; 
			Если РезультатЗапроса.Опоросов > 0 Тогда  
				ПодсосныхДнейНаОпорос = Окр(РезультатЗапроса.ПодсосныеДни / РезультатЗапроса.Опоросов,0) ; 
				ВозрастПриОтъемеНаОпорос = Окр(РезультатЗапроса.ВозрастОтъема / РезультатЗапроса.Опоросов,0) ;  
			Иначе 
				ПодсосныхДнейНаОпорос = 0;  
				ВозрастПриОтъемеНаОпорос = 0;
			КонецЕсли;
		КонецЦикла;     
		Если СупоросныхДнейНаОпорос > 0 И ПодсосныхДнейНаОпорос > 0 Тогда
			ПроизведеноОпоросов = ПродуктивныеДни / (СупоросныхДнейНаОпорос + ПодсосныхДнейНаОпорос);  
		КонецЕсли;
		РезультатЗапроса = РезультатЗапросаПакет[5].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	  
			НепродуктивныеДни = РезультатЗапроса.ПотеряноКормодней; 
			Если ПроизведеноОпоросов > 0  Тогда
				ПустыеДниНаОпорос = Окр(РезультатЗапроса.ПотеряноКормодней / ПроизведеноОпоросов,0) ;		
			КонецЕсли;
		КонецЦикла;  
		Если (ПродуктивныеДни + НепродуктивныеДни) > 0  Тогда
			ОпоросовНаСвиноматкуВГод = ОКР(ПроизведеноОпоросов /((ПродуктивныеДни + НепродуктивныеДни)/365),2);
			ОбластьШапкаПроизводствоДанные.Параметры.ЖиворожденныхНаСвиноматкуВГод = ОКР(ЖиворожденныеНаОпорос * ОпоросовНаСвиноматкуВГод,2);   
			ОбластьШапкаПроизводствоДанные.Параметры.ОтнятоПоросятНаСвиноматкуВГод = ОКР(ОтнятыхНаОпорос * ОпоросовНаСвиноматкуВГод,2); 
		КонецЕсли;	
		Если МассивСлучек[НомерОпороса - 1] > 0 Тогда  
			СуммаОпросов 	= СуммаОпросов + МассивОпоросов[НомерОпороса - 1];
			СуммаСлучек 	= СуммаСлучек +  МассивСлучек[НомерОпороса - 1];	
			ОбластьШапкаПроизводствоДанные.Параметры.ПроцентОпороса = ОКР(МассивОпоросов[НомерОпороса - 1] * 100 / МассивСлучек[НомерОпороса - 1],2);
		КонецЕсли;
		
		
		ТабДок.Присоединить(ОбластьШапкаПроизводствоДанные); 
		НомерОпороса = НомерОпороса + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЖурналОпороса.НомерЖивотного КАК НомерЖивотного,
	|	ЖурналОпороса.Живорожденные КАК Живорожденные,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
	|ГДЕ
	|	ЖурналОпороса.Период МЕЖДУ &ДатаНач И &ДатаКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТДанные.Живорожденные) КАК Живорожденные,
	|	МАКСИМУМ(ВТДанные.НомерЗаписи) КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТРасчет
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасчет.НомерЗаписи КАК КоличествоОпоросов,
	|	ЕСТЬNULL(ОКР(ВТРасчет.Живорожденные / ВТРасчет.НомерЗаписи, 2), 0) КАК ЖиворожденныеНаОпорос
	|ИЗ
	|	ВТРасчет КАК ВТРасчет"; 
	Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();      
	ОбластьПроизводствоИтого = Макет.ПолучитьОбласть("Производство|Итого"); 
	ЖиворожденныеНаОпорос = 0;
	Пока РезультатЗапроса.Следующий() Цикл  
		ЖиворожденныеНаОпорос = РезультатЗапроса.ЖиворожденныеНаОпорос;	 
	КонецЦикла;    
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЖурналОтъема.КоличествоОтъемышей КАК КоличествоОтъемышей,
	|	ЖурналОтъема.МассаВсего КАК МассаВсего,
	|	ЖурналОтъема.НомерЖивотного КАК НомерЖивотного,
	|	АВТОНОМЕРЗАПИСИ() КАК КоличествоОтъемов
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
	|ГДЕ
	|	ЖурналОтъема.Период МЕЖДУ &ДатаНач И &ДатаКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТДанные.КоличествоОтъемышей) КАК КоличествоОтъемышей,
	|	СУММА(ВТДанные.МассаВсего) КАК МассаВсего,
	|	МАКСИМУМ(ВТДанные.КоличествоОтъемов) КАК КоличествоОтъемов
	|ПОМЕСТИТЬ ВТРасчет
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасчет.КоличествоОтъемышей КАК ОтнятыхПоросят,
	|	ВТРасчет.МассаВсего КАК ВесОтъема,
	|	ОКР(ВТРасчет.МассаВсего / ВТРасчет.КоличествоОтъемышей, 1) КАК ВесОтъемаПоросят,
	|	ЕСТЬNULL(ОКР(ВТРасчет.КоличествоОтъемышей / ВТРасчет.КоличествоОтъемов, 1),0) КАК ОтнятоНаОтъем
	|ИЗ
	|	ВТРасчет КАК ВТРасчет";
	Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
	Пока РезультатЗапроса.Следующий() Цикл 		
		ОтнятыхНаОпорос = РезультатЗапроса.ОтнятоНаОтъем;;			
	КонецЦикла;                                     
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
	|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
	|	КлючевыеЦифрыОпороса.ПодсосныеДни КАК ПодсосныеДни
	|ПОМЕСТИТЬ ВТПодсос
	|ИЗ
	|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
	|ГДЕ
	|	КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
	|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
	|	КлючевыеЦифрыОпороса.ДниСупоросности КАК ДниСупоросности
	|ПОМЕСТИТЬ ВТСупоросность
	|ИЗ
	|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
	|ГДЕ
	|	КлючевыеЦифрыОпороса.ДатаОпороса МЕЖДУ &ДатаНач И &ДатаКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
	|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
	|	КлючевыеЦифрыОпороса.ПотеряноКормодней КАК ПотеряноКормодней
	|ПОМЕСТИТЬ ВТПотеряноДней
	|ИЗ
	|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
	|ГДЕ
	|	(КлючевыеЦифрыОпороса.ДатаСлучки МЕЖДУ &ДатаНач И &ДатаКон
	|				И КлючевыеЦифрыОпороса.ДатаОпороса = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ КлючевыеЦифрыОпороса.ДатаАборта МЕЖДУ &ДатаНач И &ДатаКон)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВТСупоросность.ДниСупоросности), 0) КАК СупоросныхДней,
	|	КОЛИЧЕСТВО(ВТСупоросность.НомерЖивотного) КАК Опоросов
	|ИЗ
	|	ВТСупоросность КАК ВТСупоросность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВТПодсос.ПодсосныеДни), 0) КАК ПодсосныеДни,
	|	КОЛИЧЕСТВО(ВТПодсос.НомерЖивотного) КАК Опоросов
	|ИЗ
	|	ВТПодсос КАК ВТПодсос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТПотеряноДней.ПотеряноКормодней) КАК ПотеряноКормодней
	|ИЗ
	|	ВТПотеряноДней КАК ВТПотеряноДней";
	Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет(); 
	
	ПродуктивныеДни = 0;
	НепродуктивныеДни = 0;
	ПроизведеноОпоросов = 0;
	
	РезультатЗапроса = РезультатЗапросаПакет[3].Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 	
		ПродуктивныеДни = РезультатЗапроса.СупоросныхДней;  
		Если РезультатЗапроса.Опоросов > 0 Тогда  
			СупоросныхДнейНаОпорос = Окр(РезультатЗапроса.СупоросныхДней / РезультатЗапроса.Опоросов,0) ;			
		Иначе
			СупоросныхДнейНаОпорос = 0;
		КонецЕсли;
	КонецЦикла;  
	РезультатЗапроса = РезультатЗапросаПакет[4].Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 	
		ПродуктивныеДни = ПродуктивныеДни + РезультатЗапроса.ПодсосныеДни; 
		Если РезультатЗапроса.Опоросов > 0 Тогда  
			ПодсосныхДнейНаОпорос = Окр(РезультатЗапроса.ПодсосныеДни / РезультатЗапроса.Опоросов,0) ;
		Иначе 
			ПодсосныхДнейНаОпорос = 0;
		КонецЕсли;
	КонецЦикла;     
	Если СупоросныхДнейНаОпорос > 0 И ПодсосныхДнейНаОпорос > 0 Тогда
		ПроизведеноОпоросов = ПродуктивныеДни / (СупоросныхДнейНаОпорос + ПодсосныхДнейНаОпорос);  
	КонецЕсли;
	РезультатЗапроса = РезультатЗапросаПакет[5].Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 	  
		НепродуктивныеДни = РезультатЗапроса.ПотеряноКормодней; 
		Если ПроизведеноОпоросов > 0  Тогда
			ПустыеДниНаОпорос = Окр(РезультатЗапроса.ПотеряноКормодней / ПроизведеноОпоросов,0) ;		
		КонецЕсли;
	КонецЦикла;  
	Если (ПродуктивныеДни + НепродуктивныеДни) > 0  Тогда
		ОпоросовНаСвиноматкуВГод = ОКР(ПроизведеноОпоросов /((ПродуктивныеДни + НепродуктивныеДни)/365),2);
		ОбластьПроизводствоИтого.Параметры.ЖиворожденныхНаСвиноматкуВГод = ОКР(ЖиворожденныеНаОпорос * ОпоросовНаСвиноматкуВГод,2);   
		ОбластьПроизводствоИтого.Параметры.ОтнятоПоросятНаСвиноматкуВГод = ОКР(ОтнятыхНаОпорос * ОпоросовНаСвиноматкуВГод,2); 
	КонецЕсли;
	
	
	Если СуммаСлучек > 0 Тогда  
		
		ОбластьПроизводствоИтого.Параметры.ПроцентОпороса = ОКР(СуммаОпросов * 100 / СуммаСлучек,2);
	КонецЕсли;
	ТабДок.Присоединить(ОбластьПроизводствоИтого);
	
	
	#КонецОбласти
	
	#Область Отъем
	НомерОпороса = 1;
	ТабДок.Вывести(ОбластьШапкаОтъем);
	Пока НомерОпороса <= МаксНомерОпороса Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЖурналОтъема.КоличествоОтъемышей КАК КоличествоОтъемышей,
		               |	ЖурналОтъема.МассаВсего КАК МассаВсего,
		               |	ЖурналОтъема.НомерЖивотного КАК НомерЖивотного,
		               |	АВТОНОМЕРЗАПИСИ() КАК КоличествоОтъемов
		               |ПОМЕСТИТЬ ВТДанные
		               |ИЗ
		               |	РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
		               |ГДЕ
		               |	ЖурналОтъема.Период МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЖурналОтъема.НомерОпороса = &НомерОпороса
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(ЖурналОпороса.НомерЖивотного) КАК КоличествоОпоросов
		               |ПОМЕСТИТЬ ВТОпоросы
		               |ИЗ
		               |	РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
		               |ГДЕ
		               |	ЖурналОпороса.Период МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЖурналОпороса.НомерОпороса = &НомерОпороса
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ВТДанные.КоличествоОтъемышей) КАК КоличествоОтъемышей,
		               |	СУММА(ВТДанные.МассаВсего) КАК МассаВсего,
		               |	МАКСИМУМ(ВТДанные.КоличествоОтъемов) КАК КоличествоОтъемов,
		               |	ВТОпоросы.КоличествоОпоросов КАК КоличествоОпоросов
		               |ПОМЕСТИТЬ ВТРасчет
		               |ИЗ
		               |	ВТДанные КАК ВТДанные,
		               |	ВТОпоросы КАК ВТОпоросы
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТОпоросы.КоличествоОпоросов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТРасчет.КоличествоОтъемышей КАК ОтнятыхПоросят,
		               |	ВТРасчет.МассаВсего КАК ВесОтъема,
		               |	ВЫБОР
		               |		КОГДА ВТРасчет.КоличествоОтъемышей = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ОКР(ВТРасчет.МассаВсего / ВТРасчет.КоличествоОтъемышей, 1)
		               |	КОНЕЦ КАК ВесОтъемаПоросят,
		               |	ВЫБОР
		               |		КОГДА ВТРасчет.КоличествоОтъемов = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ОКР(ВТРасчет.КоличествоОтъемышей / ВТРасчет.КоличествоОтъемов, 1)
		               |	КОНЕЦ КАК ОтнятоНаОтъем,
		               |	ВЫБОР
		               |		КОГДА ВТРасчет.КоличествоОпоросов = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ОКР(ВТРасчет.КоличествоОтъемышей / ВТРасчет.КоличествоОпоросов, 1)
		               |	КОНЕЦ КАК ОтнятоНаОпорос,
		               |	ВТРасчет.КоличествоОтъемов КАК КоличествоОтъемов
		               |ИЗ
		               |	ВТРасчет КАК ВТРасчет";
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("НомерОпороса",НомерОпороса);
		РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
		ОбластьШапкаОтъемДанные  = Макет.ПолучитьОбласть("Отъем|Данные");
		Пока РезультатЗапроса.Следующий() Цикл 		
			ОбластьШапкаОтъемДанные.Параметры.Заполнить(РезультатЗапроса);			
		КонецЦикла; 
		
		Если МассивЖиворожденных[НомерОпороса-1] > 0  Тогда    
			ОтнятыхПоросят = ?(ЗначениеЗаполнено(ОбластьШапкаОтъемДанные.Параметры.ОтнятыхПоросят),ОбластьШапкаОтъемДанные.Параметры.ОтнятыхПоросят,0); 
			ОбластьШапкаОтъемДанные.Параметры.ПадежДоОтъема = 100 - ОКР(ОтнятыхПоросят / (МассивЖиворожденных[НомерОпороса-1]) * 100,2);
		КонецЕсли;
		СуммаЖиворожденных = СуммаЖиворожденных + МассивЖиворожденных[НомерОпороса-1];
		ТабДок.Присоединить(ОбластьШапкаОтъемДанные); 
		НомерОпороса = НомерОпороса + 1;
	КонецЦикла;
	
	ОбластьОтъемИтого  = Макет.ПолучитьОбласть("Отъем|Итого");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖурналОтъема.КоличествоОтъемышей КАК КоличествоОтъемышей,
	               |	ЖурналОтъема.МассаВсего КАК МассаВсего,
	               |	ЖурналОтъема.НомерЖивотного КАК НомерЖивотного,
	               |	АВТОНОМЕРЗАПИСИ() КАК КоличествоОтъемов
	               |ПОМЕСТИТЬ ВТДанные
	               |ИЗ
	               |	РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
	               |ГДЕ
	               |	ЖурналОтъема.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ЖурналОпороса.НомерЖивотного) КАК КоличествоОпоросов
	               |ПОМЕСТИТЬ ВТОпоросы
	               |ИЗ
	               |	РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
	               |ГДЕ
	               |	ЖурналОпороса.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТДанные.КоличествоОтъемышей) КАК КоличествоОтъемышей,
	               |	СУММА(ВТДанные.МассаВсего) КАК МассаВсего,
	               |	МАКСИМУМ(ВТДанные.КоличествоОтъемов) КАК КоличествоОтъемов,
	               |	ВТОпоросы.КоличествоОпоросов КАК КоличествоОпоросов
	               |ПОМЕСТИТЬ ВТРасчет
	               |ИЗ
	               |	ВТДанные КАК ВТДанные,
	               |	ВТОпоросы КАК ВТОпоросы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТОпоросы.КоличествоОпоросов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТРасчет.КоличествоОтъемышей КАК ОтнятыхПоросят,
	               |	ВТРасчет.МассаВсего КАК ВесОтъема,
	               |	ВЫБОР
	               |		КОГДА ВТРасчет.КоличествоОтъемышей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ОКР(ВТРасчет.МассаВсего / ВТРасчет.КоличествоОтъемышей, 1)
	               |	КОНЕЦ КАК ВесОтъемаПоросят,
	               |	ВЫБОР
	               |		КОГДА ВТРасчет.КоличествоОтъемов = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ОКР(ВТРасчет.КоличествоОтъемышей / ВТРасчет.КоличествоОтъемов, 1)
	               |	КОНЕЦ КАК ОтнятоНаОтъем,
	               |	ВЫБОР
	               |		КОГДА ВТРасчет.КоличествоОтъемов = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ОКР(ВТРасчет.КоличествоОтъемышей / ВТРасчет.КоличествоОпоросов, 1)
	               |	КОНЕЦ КАК ОтнятоНаОпорос,
	               |	ВТРасчет.КоличествоОтъемов КАК КоличествоОтъемов
	               |ИЗ
	               |	ВТРасчет КАК ВТРасчет";
	Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
	ОбластьОтъемИтого  = Макет.ПолучитьОбласть("Отъем|Итого");
	Пока РезультатЗапроса.Следующий() Цикл 		
		ОбластьОтъемИтого.Параметры.Заполнить(РезультатЗапроса);			
	КонецЦикла; 
	
	ОтнятыхПоросят = ?(ЗначениеЗаполнено(ОбластьОтъемИтого.Параметры.ОтнятыхПоросят),ОбластьОтъемИтого.Параметры.ОтнятыхПоросят,0); 
	Если СуммаЖиворожденных > 0 Тогда
		ОбластьОтъемИтого.Параметры.ПадежДоОтъема = 100 - ОКР(ОтнятыхПоросят / (СуммаЖиворожденных) * 100,2);
	КонецЕсли;
	ТабДок.Присоединить(ОбластьОтъемИтого);	
	
	#КонецОбласти
	
	#Область Результат
	НомерОпороса = 1;
	ТабДок.Вывести(ОбластьШапкаРезультат);
	Пока НомерОпороса <= МаксНомерОпороса Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		|	КлючевыеЦифрыОпороса.ПодсосныеДни КАК ПодсосныеДни,
		|	КлючевыеЦифрыОпороса.ВозрастОтъема КАК ВозрастОтъема
		|ПОМЕСТИТЬ ВТПодсос
		|ИЗ
		|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		|ГДЕ
		|	КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		|	И КлючевыеЦифрыОпороса.НомерОпороса = &НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		|	КлючевыеЦифрыОпороса.ДниСупоросности КАК ДниСупоросности
		|ПОМЕСТИТЬ ВТСупоросность
		|ИЗ
		|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		|ГДЕ
		|	КлючевыеЦифрыОпороса.ДатаОпороса МЕЖДУ &ДатаНач И &ДатаКон
		|	И КлючевыеЦифрыОпороса.НомерОпороса = &НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,";
		Если НЕ Константы.РасчетПустыхДнейДоУбоя.Получить() Тогда
			Запрос.Текст = Запрос.Текст + 		   
			"	ВЫБОР
			|		КОГДА РегистрПоследнееСобытие.ПоследнееСобытие = ЗНАЧЕНИЕ(Перечисление.ПоследнееСобытие.Выбытие)
			|			ТОГДА КлючевыеЦифрыОпороса.ПотеряноКормодней
			|		ИНАЧЕ КлючевыеЦифрыОпороса.ПотеряноКормодней
			|	КОНЕЦ КАК ПотеряноКормодней,"
		Иначе 
			Запрос.Текст = Запрос.Текст + 			   
			"	ВЫБОР
			|		КОГДА РегистрПоследнееСобытие.ПоследнееСобытие = ЗНАЧЕНИЕ(Перечисление.ПоследнееСобытие.Выбытие)
			|			ТОГДА КлючевыеЦифрыОпороса.ПотеряноКормодней
			|		ИНАЧЕ КлючевыеЦифрыОпороса.ПотеряноКормодней + РАЗНОСТЬДАТ(РегистрПоследнееСобытие.ДатаПоследнегоСобытия, &ТекущаяДата, ДЕНЬ)
			|	КОНЕЦ КАК ПотеряноКормодней,"
		КонецЕсли; 
		Запрос.Текст = Запрос.Текст + 		   
		"	КлючевыеЦифрыОпороса.ПотеряноКормодней КАК ПотеряноКормоднейДляРасчета
		|ПОМЕСТИТЬ ВТПотеряноДней
		|ИЗ
		|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоследнееСобытие КАК РегистрПоследнееСобытие
		|		ПО КлючевыеЦифрыОпороса.НомерЖивотного = РегистрПоследнееСобытие.НомерЖивотного
		|			И КлючевыеЦифрыОпороса.ДатаВвода = РегистрПоследнееСобытие.ДатаВвода
		|			И КлючевыеЦифрыОпороса.НомерОпороса = РегистрПоследнееСобытие.НомерОпороса
		|ГДЕ
		|	(КлючевыеЦифрыОпороса.ДатаСлучки МЕЖДУ &ДатаНач И &ДатаКон
		|				И КлючевыеЦифрыОпороса.ДатаОпороса = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		|			ИЛИ КлючевыеЦифрыОпороса.ДатаАборта МЕЖДУ &ДатаНач И &ДатаКон)
		|	И КлючевыеЦифрыОпороса.НомерОпороса = &НомерОпороса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТСупоросность.ДниСупоросности), 0) КАК СупоросныхДней,
		|	КОЛИЧЕСТВО(ВТСупоросность.НомерЖивотного) КАК Опоросов
		|ИЗ
		|	ВТСупоросность КАК ВТСупоросность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТПодсос.ПодсосныеДни), 0) КАК ПодсосныеДни,
		|	КОЛИЧЕСТВО(ВТПодсос.НомерЖивотного) КАК Опоросов,
		|	ЕСТЬNULL(СУММА(ВТПодсос.ВозрастОтъема), 0) КАК ВозрастОтъема
		|ИЗ
		|	ВТПодсос КАК ВТПодсос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТПотеряноДней.ПотеряноКормодней), 0) КАК ПотеряноКормодней,
		|	ЕСТЬNULL(СУММА(ВТПотеряноДней.ПотеряноКормоднейДляРасчета), 0) КАК ПотеряноКормоднейДляРасчета
		|ИЗ
		|	ВТПотеряноДней КАК ВТПотеряноДней";
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("НомерОпороса",НомерОпороса);
		Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДатаСеанса());
		РезультатЗапросаПакет = Запрос.ВыполнитьПакет(); 
		ОбластьШапкаРезультатДанные  = Макет.ПолучитьОбласть("Результат|Данные");      
		
		ПродуктивныеДни = 0;
		НепродуктивныеДни = 0;
		ПроизведеноОпоросов = 0;
		
		РезультатЗапроса = РезультатЗапросаПакет[3].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	
			ПродуктивныеДни = РезультатЗапроса.СупоросныхДней;  
			Если РезультатЗапроса.Опоросов > 0 Тогда  
				ОбластьШапкаРезультатДанные.Параметры.СупоросныхДнейНаОпорос = Окр(РезультатЗапроса.СупоросныхДней / РезультатЗапроса.Опоросов,0) ;			
			Иначе
				ОбластьШапкаРезультатДанные.Параметры.СупоросныхДнейНаОпорос = 0;
			КонецЕсли;
		КонецЦикла;  
		РезультатЗапроса = РезультатЗапросаПакет[4].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	
			ПродуктивныеДни = ПродуктивныеДни + РезультатЗапроса.ПодсосныеДни; 
			Если РезультатЗапроса.Опоросов > 0 Тогда  
				ОбластьШапкаРезультатДанные.Параметры.ПодсосныхДнейНаОпорос = Окр(РезультатЗапроса.ПодсосныеДни / РезультатЗапроса.Опоросов,0) ;   
				ОбластьШапкаРезультатДанные.Параметры.ВозрастПриОтъемеНаОпорос = Окр(РезультатЗапроса.ВозрастОтъема / РезультатЗапроса.Опоросов,0) ;
				
			Иначе 
				ОбластьШапкаРезультатДанные.Параметры.ПодсосныхДнейНаОпорос = 0; 
				ОбластьШапкаРезультатДанные.Параметры.ВозрастПриОтъемеНаОпорос = 0;
			КонецЕсли;
		КонецЦикла;     
		Если ОбластьШапкаРезультатДанные.Параметры.СупоросныхДнейНаОпорос > 0 И ОбластьШапкаРезультатДанные.Параметры.ПодсосныхДнейНаОпорос > 0 Тогда
			ПроизведеноОпоросов = ПродуктивныеДни / (ОбластьШапкаРезультатДанные.Параметры.СупоросныхДнейНаОпорос + ОбластьШапкаРезультатДанные.Параметры.ПодсосныхДнейНаОпорос);  
		КонецЕсли;
		РезультатЗапроса = РезультатЗапросаПакет[5].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	  
			НепродуктивныеДни = РезультатЗапроса.ПотеряноКормоднейДляРасчета; 
			Если ПроизведеноОпоросов > 0  Тогда
				ОбластьШапкаРезультатДанные.Параметры.ПустыеДниНаОпорос = Окр(РезультатЗапроса.ПотеряноКормодней / ПроизведеноОпоросов,2) ;		
			КонецЕсли;
		КонецЦикла;  
		Если (ПродуктивныеДни + НепродуктивныеДни) > 0  Тогда
			ОбластьШапкаРезультатДанные.Параметры.ОпоросовНаСвиноматкуВГод = ОКР(ПроизведеноОпоросов /((ПродуктивныеДни + НепродуктивныеДни)/365),2);
		КонецЕсли;		
		
		ТабДок.Присоединить(ОбластьШапкаРезультатДанные); 
		НомерОпороса = НомерОпороса + 1;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
	|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
	|	КлючевыеЦифрыОпороса.ПодсосныеДни КАК ПодсосныеДни,
	|	КлючевыеЦифрыОпороса.ВозрастОтъема КАК ВозрастОтъема
	|ПОМЕСТИТЬ ВТПодсос
	|ИЗ
	|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
	|ГДЕ
	|	КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
	|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
	|	КлючевыеЦифрыОпороса.ДниСупоросности КАК ДниСупоросности
	|ПОМЕСТИТЬ ВТСупоросность
	|ИЗ
	|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
	|ГДЕ
	|	КлючевыеЦифрыОпороса.ДатаОпороса МЕЖДУ &ДатаНач И &ДатаКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
	|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,";
	Если НЕ Константы.РасчетПустыхДнейДоУбоя.Получить() Тогда
		Запрос.Текст = Запрос.Текст + 		   
		"	ВЫБОР
		|		КОГДА РегистрПоследнееСобытие.ПоследнееСобытие = ЗНАЧЕНИЕ(Перечисление.ПоследнееСобытие.Выбытие)
		|			ТОГДА КлючевыеЦифрыОпороса.ПотеряноКормодней
		|		ИНАЧЕ КлючевыеЦифрыОпороса.ПотеряноКормодней
		|	КОНЕЦ КАК ПотеряноКормодней,"
	Иначе 
		Запрос.Текст = Запрос.Текст + 			   
		"	ВЫБОР
		|		КОГДА РегистрПоследнееСобытие.ПоследнееСобытие = ЗНАЧЕНИЕ(Перечисление.ПоследнееСобытие.Выбытие)
		|			ТОГДА КлючевыеЦифрыОпороса.ПотеряноКормодней
		|		ИНАЧЕ КлючевыеЦифрыОпороса.ПотеряноКормодней + РАЗНОСТЬДАТ(РегистрПоследнееСобытие.ДатаПоследнегоСобытия, &ТекущаяДата, ДЕНЬ)
		|	КОНЕЦ КАК ПотеряноКормодней,"
	КонецЕсли; 
	Запрос.Текст = Запрос.Текст + 		   
	"	КлючевыеЦифрыОпороса.ПотеряноКормодней КАК ПотеряноКормоднейДляРасчета
	|ПОМЕСТИТЬ ВТПотеряноДней
	|ИЗ
	|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоследнееСобытие КАК РегистрПоследнееСобытие
	|		ПО КлючевыеЦифрыОпороса.НомерЖивотного = РегистрПоследнееСобытие.НомерЖивотного
	|			И КлючевыеЦифрыОпороса.ДатаВвода = РегистрПоследнееСобытие.ДатаВвода
	|			И КлючевыеЦифрыОпороса.НомерОпороса = РегистрПоследнееСобытие.НомерОпороса
	|ГДЕ
	|	(КлючевыеЦифрыОпороса.ДатаСлучки МЕЖДУ &ДатаНач И &ДатаКон
	|				И КлючевыеЦифрыОпороса.ДатаОпороса = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ КлючевыеЦифрыОпороса.ДатаАборта МЕЖДУ &ДатаНач И &ДатаКон)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВТСупоросность.ДниСупоросности), 0) КАК СупоросныхДней,
	|	КОЛИЧЕСТВО(ВТСупоросность.НомерЖивотного) КАК Опоросов
	|ИЗ
	|	ВТСупоросность КАК ВТСупоросность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВТПодсос.ПодсосныеДни), 0) КАК ПодсосныеДни,
	|	КОЛИЧЕСТВО(ВТПодсос.НомерЖивотного) КАК Опоросов,
	|	ЕСТЬNULL(СУММА(ВТПодсос.ВозрастОтъема), 0) КАК ВозрастОтъема
	|ИЗ
	|	ВТПодсос КАК ВТПодсос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВТПотеряноДней.ПотеряноКормодней),0) КАК ПотеряноКормодней,
	|	ЕСТЬNULL(СУММА(ВТПотеряноДней.ПотеряноКормоднейДляРасчета),0) КАК ПотеряноКормоднейДляРасчета
	|ИЗ
	|	ВТПотеряноДней КАК ВТПотеряноДней";
	Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания); 
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДатаСеанса());
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет(); 
	ОбластьРезультатИтого  = Макет.ПолучитьОбласть("Результат|Итого");      
	
	ПродуктивныеДни = 0;
	НепродуктивныеДни = 0;
	ПроизведеноОпоросов = 0;
	
	РезультатЗапроса = РезультатЗапросаПакет[3].Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 	
		ПродуктивныеДни = РезультатЗапроса.СупоросныхДней;  
		Если РезультатЗапроса.Опоросов > 0 Тогда  
			ОбластьРезультатИтого.Параметры.СупоросныхДнейНаОпорос = Окр(РезультатЗапроса.СупоросныхДней / РезультатЗапроса.Опоросов,0) ;			
		Иначе
			ОбластьРезультатИтого.Параметры.СупоросныхДнейНаОпорос = 0;     
		КонецЕсли;
	КонецЦикла;  
	РезультатЗапроса = РезультатЗапросаПакет[4].Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 	
		ПродуктивныеДни = ПродуктивныеДни + РезультатЗапроса.ПодсосныеДни; 
		Если РезультатЗапроса.Опоросов > 0 Тогда  
			ОбластьРезультатИтого.Параметры.ПодсосныхДнейНаОпорос = Окр(РезультатЗапроса.ПодсосныеДни / РезультатЗапроса.Опоросов,0) ;
			ОбластьРезультатИтого.Параметры.ВозрастПриОтъемеНаОпорос = Окр(РезультатЗапроса.ВозрастОтъема / РезультатЗапроса.Опоросов,0) ; 
		Иначе 
			ОбластьРезультатИтого.Параметры.ПодсосныхДнейНаОпорос = 0;
			ОбластьРезультатИтого.Параметры.ВозрастПриОтъемеНаОпорос = 0;
		КонецЕсли;
	КонецЦикла;     
	Если ОбластьРезультатИтого.Параметры.СупоросныхДнейНаОпорос > 0 И ОбластьРезультатИтого.Параметры.ПодсосныхДнейНаОпорос > 0 Тогда
		ПроизведеноОпоросов = ПродуктивныеДни / (ОбластьРезультатИтого.Параметры.СупоросныхДнейНаОпорос + ОбластьРезультатИтого.Параметры.ПодсосныхДнейНаОпорос);  
	КонецЕсли;
	РезультатЗапроса = РезультатЗапросаПакет[5].Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 	  
		НепродуктивныеДни = РезультатЗапроса.ПотеряноКормоднейДляРасчета; 
		Если ПроизведеноОпоросов > 0  Тогда
			ОбластьРезультатИтого.Параметры.ПустыеДниНаОпорос = Окр(РезультатЗапроса.ПотеряноКормодней / ПроизведеноОпоросов,2) ;		
		КонецЕсли;
	КонецЦикла;  
	Если (ПродуктивныеДни + НепродуктивныеДни) > 0  Тогда
		ОбластьРезультатИтого.Параметры.ОпоросовНаСвиноматкуВГод = ОКР(ПроизведеноОпоросов /((ПродуктивныеДни + НепродуктивныеДни)/365),2);
	КонецЕсли;		
	
	ТабДок.Присоединить(ОбластьРезультатИтого); 
	
	
	
	#КонецОбласти
	
	ТабДок.АвтоМасштаб = Истина;
КонецПроцедуры
